import React from 'react';
import Logo from "../img/logo.svg";

const Footer = () => {
    return (
        <footer id='footer' className="w-100">
            <div className="container">
                <div
                    className='footerNavList d-flex flex-column flex-sm-column flex-md-row flex-lg-row flex-xl-row flex-xxl-row'>
                    <div className='footerNavItem'>
                        <h2>Мониторинг</h2>
                        <ul className='navFooter d-flex flex-column p-0 pt-2'>
                            <li className='navItem'>
                                <a className='navLink' href="#">Раскрутить
                                    сервер</a>
                            </li>
                            <li className='navItem'>
                                <a className='navLink' href="#">Добавить сервер</a>
                            </li>
                            <li className='navItem'>
                                <a className='navLink' href="#">Найти сервер
                                    Майнкрафт</a>
                            </li>
                            <li className='navItem'>
                                <a className='navLink' href="#">Донат</a>
                            </li>
                        </ul>
                    </div>
                    <div className='footerNavItem'>
                        <h2>Следите за нами</h2>
                        <ul className='navFooter d-flex flex-column p-0 pt-2'>
                            <li className='navItem'>
                                <a className='navLink d-flex align-items-center gap-1 opacity-100' target={"_blank"} href="#"><svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                    <g clip-path="url(#clip0_847_376)">
                                        <path d="M19.1305 13.2365C18.695 12.7138 18.2002 12.2453 17.7216 11.7923C17.5515 11.6311 17.3755 11.4646 17.2059 11.2989C16.719 10.8228 16.7012 10.644 17.0868 10.1032C17.3535 9.73046 17.6363 9.35722 17.9098 8.99625C18.1578 8.66875 18.4144 8.33008 18.6602 7.99031L18.7107 7.92045C19.1806 7.27024 19.6666 6.59791 19.9252 5.78684C19.9924 5.57286 20.0629 5.25797 19.9017 4.99466C19.7405 4.73158 19.428 4.65131 19.2068 4.61382C19.0974 4.59527 18.9888 4.59274 18.888 4.59274L15.8106 4.59054L15.7852 4.59032C15.3199 4.59032 15.0063 4.80958 14.8267 5.26072C14.6551 5.69177 14.4667 6.15079 14.2517 6.58723C13.8237 7.45631 13.2803 8.4573 12.4939 9.29215L12.4606 9.32766C12.3678 9.42746 12.2626 9.54048 12.1857 9.54048C12.1739 9.54048 12.161 9.53822 12.1465 9.53366C11.9836 9.47018 11.8743 9.07585 11.8792 8.89242C11.8793 8.88989 11.8794 8.88736 11.8794 8.88483L11.8772 5.328C11.8772 5.31567 11.8763 5.30344 11.8747 5.29122C11.7964 4.71302 11.623 4.3531 10.9678 4.22478C10.9504 4.22131 10.9326 4.2196 10.9149 4.2196H7.71504C7.19371 4.2196 6.90645 4.43149 6.63643 4.74864C6.56354 4.83342 6.41182 5.00991 6.48702 5.22401C6.56332 5.44129 6.81099 5.48775 6.89164 5.50284C7.29197 5.57903 7.51762 5.82389 7.58154 6.25175C7.69313 6.99471 7.70683 7.78772 7.6247 8.74742C7.6018 9.01414 7.55649 9.22014 7.48184 9.39614C7.4645 9.43721 7.40301 9.57126 7.34031 9.57131C7.32038 9.57131 7.26274 9.56349 7.15776 9.49116C6.90953 9.3211 6.72792 9.07844 6.5162 8.77869C5.79591 7.76075 5.1914 6.63936 4.66787 5.34969C4.4737 4.87493 4.11108 4.60914 3.64635 4.60133C3.13569 4.59356 2.67272 4.58982 2.23115 4.58982C1.74869 4.58982 1.3014 4.59428 0.864629 4.60336C0.490725 4.60997 0.232096 4.72205 0.0960105 4.93675C-0.0402952 5.15161 -0.031432 5.43386 0.12238 5.7755C1.35365 8.51279 2.47002 10.503 3.74224 12.229C4.63368 13.4367 5.52782 14.2726 6.55583 14.8595C7.6389 15.4791 8.85266 15.7804 10.2664 15.7804C10.4266 15.7804 10.5923 15.7765 10.7594 15.7687C11.5809 15.7286 11.8856 15.4313 11.9242 14.6315C11.9425 14.2227 11.9872 13.794 12.1881 13.4284C12.315 13.1981 12.4332 13.1981 12.4721 13.1981C12.547 13.1981 12.6398 13.2326 12.7395 13.2971C12.9183 13.4139 13.0716 13.5702 13.1973 13.7068C13.3156 13.8365 13.4326 13.9676 13.5496 14.0987C13.8023 14.3818 14.0636 14.6744 14.3365 14.9519C14.934 15.5597 15.5921 15.827 16.348 15.769H19.1695C19.1755 15.769 19.1815 15.7688 19.1875 15.7684C19.4687 15.7498 19.7121 15.5939 19.8555 15.3405C20.0332 15.0267 20.0296 14.6263 19.846 14.2692C19.6376 13.8655 19.3673 13.5205 19.1305 13.2365Z" fill="white"/>
                                    </g>
                                    <defs>
                                        <clipPath id="clip0_847_376">
                                            <rect width="20" height="20" fill="white"/>
                                        </clipPath>
                                    </defs>
                                </svg>ВКонтакте</a>
                            </li>
                            <li className='navItem'>
                                <a className='navLink telegram d-flex align-items-center gap-1 opacity-100' target={"_blank"} href="#">
                                    <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                                        <path d="M8.14941 15.5417L8.38275 12.0167L14.7827 6.25001C15.0661 5.99168 14.7244 5.86668 14.3494 6.09168L6.44941 11.0833L3.03275 10C2.29941 9.79168 2.29108 9.28335 3.19941 8.91668L16.5077 3.78335C17.1161 3.50835 17.6994 3.93335 17.4661 4.86668L15.1994 15.5417C15.0411 16.3 14.5827 16.4833 13.9494 16.1333L10.4994 13.5833L8.84108 15.1917C8.64941 15.3833 8.49108 15.5417 8.14941 15.5417Z" fill="white"/>
                                    </svg>Telegram</a>
                            </li>
                        </ul>
                    </div>
                    <div className='footerNavItem'>
                        <h2>Разработчики</h2>
                        <ul className='navFooter d-flex flex-column p-0 pt-2'>
                            <li className='navItem'>
                                <a target={'_blank'} className='navLink' href="https://vk.com/churyanov">Максим Чурьянов</a>
                            </li>
                            <li className='navItem'>
                                <a target={'_blank'} className='navLink' href="https://vk.com/maximuix">Максим Иванов</a>
                            </li>
                        </ul>
                    </div>
                </div>
                <hr style={{color: '#FFFFFF', height: '2px', opacity: '0.5', margin: '0px 0px 0px 0px'}}></hr>
                <div className='allRights'>
                    <div className='container d-flex flex-row align-items-center justify-content-between allRights'>
                        <a href='/'>
                            <img src={Logo} alt="лого"/>
                        </a>
                        <h6 className="opacity-50">© 2023
                            MINE-LIST.RU —
                            лучший рейтинг серверов Майнкрафт. Этот сайт никак не связан с компанией Mojang.</h6>

                    </div>
                </div>
            </div>
        </footer>
    );
};

export default Footer;